# 판다스 기초 연습 1

In [87]:
import pandas as pd
import numpy as np

In [88]:
data = np.array([[95,91],
                 [92,93],
                 [98,97],
                 [100,99]
                 ])

In [89]:
data.ndim

2

In [90]:
data.shape

(4, 2)

In [91]:
data.size

8

In [92]:
data.dtype

dtype('int32')

In [93]:
pd.DataFrame(data=data,columns=['class a','class b'])

   class a  class b
0       95       91
1       92       93
2       98       97
3      100       99

# 판다스 기초 연습 2

In [94]:
import pandas as pd
import numpy as np

In [95]:
data = np.array([[95,91],
                 [95,98],
                 [87,91],
                 [95,60]])

In [96]:
data.dtype

dtype('int32')

In [97]:
data.shape

(4, 2)

In [98]:
data.ndim

2

In [99]:
data.size

8

In [100]:
classdf = pd.DataFrame(data=data,columns=['class a','class b'])
classdf

   class a  class b
0       95       91
1       95       98
2       87       91
3       95       60

In [101]:
#인덱스를 찾기 위해서는 iloc
#몽키스패너 기호는 함수가 아니라는 뜻
classdf.iloc[0]

class a    95
class b    91
Name: 0, dtype: int32

In [102]:
type(classdf.iloc[0])

pandas.core.series.Series

In [103]:
classdf['class a']

0    95
1    95
2    87
3    95
Name: class a, dtype: int32

In [104]:
data2 = np.array([[87,85],
                 [89,90],
                ])

In [105]:
df2 = pd.DataFrame(data=data2,columns=['class a','class b'])
df2

   class a  class b
0       87       85
1       89       90

In [106]:
arr2d_2 = np.array([[100],
          [100],
          [100],
          [100]])

In [107]:
df4 = pd.DataFrame(data=arr2d_2,columns=['class d'])
df4

   class d
0      100
1      100
2      100
3      100

In [108]:
classdf.join(df4)

   class a  class b  class d
0       95       91      100
1       95       98      100
2       87       91      100
3       95       60      100

In [109]:
df2

   class a  class b
0       87       85
1       89       90

In [110]:
pd.concat([classdf,df2])

   class a  class b
0       95       91
1       95       98
2       87       91
3       95       60
0       87       85
1       89       90

In [111]:
pd.concat([classdf,df2],ignore_index=True)
# 위의 표와 비교한다
#이전 인덱스를 무시해서 결과값의 인덱스를 순서대로 만든다

   class a  class b
0       95       91
1       95       98
2       87       91
3       95       60
4       87       85
5       89       90

# 표를 만드는 일반적인 방법

In [113]:
data1 = {'id':['hong1','hong2','hong3','hong4','hong5'],
         'name':['홍일동','홍이동','홍삼동','홍사동','홍오동'],
         'height':[166,	168,170,172,174]}

In [114]:
pd.DataFrame(data1)

      id name  height
0  hong1  홍일동     166
1  hong2  홍이동     168
2  hong3  홍삼동     170
3  hong4  홍사동     172
4  hong5  홍오동     174

# 표를 만드는 일반적인 방법 2

In [115]:
idx = ['hong1','hong2','hong3','hong4','hong5']

In [116]:
data2 = {'name':['홍일동','홍이동','홍삼동','홍사동','홍오동'],
         'height':[166,	168,170,172,174]}

In [117]:
pd.DataFrame(data2,index=pd.Index((idx),name='student'))

        name  height
student
hong1    홍일동     166
hong2    홍이동     168
hong3    홍삼동     170
hong4    홍사동     172
hong5    홍오동     174

In [118]:
df1_stu.columns

Index(['id', 'name', 'height'], dtype='object')

In [119]:
df1_stu = pd.DataFrame(data1)

In [120]:
df1_stu.index

RangeIndex(start=0, stop=5, step=1)

In [122]:
df1_stu.loc['hong3']

KeyError: 'hong3'

# 표

주로 가로에는 성격,속성 > 이를 어길시 분석이 어려워진다

필요할시 > 전치 transpose

observation,sample.object: 객체 / 예.홍일 학생, 동길 학생

In [123]:
classdf.T #trnaspose

          0   1   2   3
class a  95  95  87  95
class b  91  98  91  60

In [ ]:
df1 = np.array([['Harry Potter','Male',23],
                ['David Baker','Male',23],
                ['John Smith','Male',23],
                ['Juan Martinez','Male',23],
                ['Jane Connor','Female',23]])

In [124]:
df1 = ({'Name':["Harry Potter",	"David Baker",	"John Smith",	"Juan Martinez",	"Jane Connor"],
        'Gender':["Male","Male","Male","Male","Female"],
        'Age':[23,31,22,36,30],})

In [130]:
final1 = pd.DataFrame(df1)
final1

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [127]:
df2 = ({'Name':["John Smith",	"Alex Du Bois",	"Joanne Rowling",	"Jane Connor"],
        'Position':["Intern","Team Lead","Manager","Manager"],
        'Wage':[25000,75000,90000,70000]})

In [131]:
final2 = pd.DataFrame(df2)
final2

             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [132]:
pd.merge(final1,final2)

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

# 표 합치기

표를 합쳐서 발생하는 빈공간: 결측치 missing value	
    
합칠 때 왼쪽을 기준으로	

left join	

오른쪽은	

right join	

inner join	

outer join

In [135]:
final1.merge(final2,on = 'Name',how = 'left')

            Name  Gender  Age Position     Wage
0   Harry Potter    Male   23      NaN      NaN
1    David Baker    Male   31      NaN      NaN
2     John Smith    Male   22   Intern  25000.0
3  Juan Martinez    Male   36      NaN      NaN
4    Jane Connor  Female   30  Manager  70000.0

In [136]:
final1.merge(final2,on = 'Name',how = 'right')

             Name  Gender   Age   Position   Wage
0      John Smith    Male  22.0     Intern  25000
1    Alex Du Bois     NaN   NaN  Team Lead  75000
2  Joanne Rowling     NaN   NaN    Manager  90000
3     Jane Connor  Female  30.0    Manager  70000

In [134]:
final1.merge(final2,on = 'Name',how = 'inner')

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [137]:
final1.merge(final2,on = 'Name',how = 'outer')

             Name  Gender   Age   Position     Wage
0    Alex Du Bois     NaN   NaN  Team Lead  75000.0
1     David Baker    Male  31.0        NaN      NaN
2    Harry Potter    Male  23.0        NaN      NaN
3     Jane Connor  Female  30.0    Manager  70000.0
4  Joanne Rowling     NaN   NaN    Manager  90000.0
5      John Smith    Male  22.0     Intern  25000.0
6   Juan Martinez    Male  36.0        NaN      NaN